# LoadFamilySymbol Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Document..::..LoadFamilySymbol Method
Document Class See Also
---
Loads only a specified family type/symbol from a family file into the document.
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LoadFamilySymbol(String, String) | Loads only a specified family type/symbol from a family file into the document. |
| LoadFamilySymbol(String, String, FamilySymbol%) | Loads only the specified family type/symbol from a family file into the document and provides a reference to the loaded family symbol. |
| LoadFamilySymbol(String, String, IFamilyLoadOptions, FamilySymbol%) | Loads only the specified family type/symbol from a family file into the document and provides a reference to the loaded family symbol. |

# See Also
Document Class
Document Members
Autodesk.Revit.DB Namespace